package main

import (
	"strings"
	"testing"
)

func TestGetNumberReading(t *testing.T) {
	tests := []struct {
		in   string
		want string
	}{
		{in: "0", want: "ゼロ"},
		{in: "1", want: "イチ"},
		{in: "2", want: "ニ"},
		{in: "3", want: "サン"},
		{in: "4", want: "ヨン"},
		{in: "5", want: "ゴ"},
		{in: "6", want: "ロク"},
		{in: "7", want: "ナナ"},
		{in: "8", want: "ハチ"},
		{in: "9", want: "キュウ"},
		{in: "10", want: "ジュウ"},
		{in: "11", want: "ジュウイチ"},
		{in: "20", want: "ニジュウ"},
		{in: "42", want: "ヨンジュウニ"},
		{in: "100", want: "ヒャク"},
		{in: "101", want: "ヒャクイチ"},
		{in: "111", want: "ヒャクジュウイチ"},
		{in: "3300", want: "サンゼンサンビャク"},
		{in: "666", want: "ロッピャクロクジュウロク"},
		{in: "8888", want: "ハッセンハッピャクハチジュウハチ"},
		{in: "1_0000", want: "イチマン"},
		{in: "1234_5678", want: "センニヒャクサンジュウヨンマンゴセンロッピャクナナジュウハチ"},
		{in: "1_0000_0000", want: "イチオク"},
		{in: "1_1000_1000", want: "イチオクセンマンセン"},
		{in: "1_2345_6789", want: "イチオクニセンサンビャクヨンジュウゴマンロクセンナナヒャクハチジュウキュウ"},
		{in: "9876_0000_4321", want: "キュウセンハッピャクナナジュウロクオクヨンセンサンビャクニジュウイチ"},
		{in: "1_0000_0000_0000", want: "イッチョウ"},
		{in: "8_0000_0000_0000", want: "ハッチョウ"},
		{in: "10_0000_0000_0000", want: "ジッチョウ"},
		{in: "1111_0000_0000_0000", want: "センヒャクジュウイッチョウ"},
		{in: "8888_0000_0000_0000", want: "ハッセンハッピャクハチジュウハッチョウ"},
		{in: "0.10", want: "レイテンイチゼロ"},
		{in: "1.23", want: "イッテンニサン"},
		{in: "10.1", want: "ジッテンイチ"},
		{in: "18.88", want: "ジュウハッテンハチハチ"},
		{in: "42.195", want: "ヨンジュウニテンイチキュウゴ"},
		{in: ".1", want: "テンイチ"},
		{in: "0.", want: "ゼロ"},
		{in: "1.", want: "イチ"},
		{in: "127.0.0.1", want: "イチニナナテンゼロテンゼロテンイチ"},
		{in: "0120", want: "ゼロイチニゼロ"},
		{in: "1_2345_6789_0123_4567", want: "イチニサンヨンゴロクナナハチキュウゼロイチニサンヨンゴロクナナ"},
	}

	for _, tt := range tests {
		tt2 := strings.ReplaceAll(tt.in, "_", "")
		got := getNumberReading(tt2)
		if got != tt.want {
			t.Errorf("getNumberReading(%s) = %s, want %s", tt.in, got, tt.want)
		}
	}
}
